/* 
  Localizable.strings
  Tiliard

  Created by Marek Toth on 7/5/11.
  Copyright 2011 2 Key Players. All rights reserved.
*/

/* --- Alerts --- */

"AlertButtonOk"="OK";
"AlertButtonYes"="Áno";
"AlertButtonNo"="Nie";
"AlertButtonRate"="Hodnotiť";
"AlertButtonLater"="Neskôr";
"AlertButtonLeaderboards"="Tabuľky";
"AlertButtonAchievements"="Úspechy";
"AlertButtonProgress"="Progres";
"AlertButtonHints"="Tipy";
"AlertButtonBack"="Späť";
"AlertButtonReset"="Resetnúť";
"AlertButtonCancel"="Zrušiť";

"AlertReset"="Resetnúť";
"AlertTableEditor"="Editor stolov";
"AlertTableEditorMessage"="Chceš vytvárať vlastné stoly?\nDaj Tiliard-u dobré hodnotenie a v ďalšej verzii sa ti to splní :)";
"AlertLanguageChange"="Info";
"AlertLanguageChangeMessage"="Zmeny sa prejavia po opustení menu Možnosti.";
"AlertTableRecord"="Rekord stola";
"AlertTableRecordMessage"="Poslať e-mail?";
"AlertMusic"="Hudba";
"AlertSound"="Zvuky";
"AlertTileSet"="Info";
"AlertTileSetMessage"="Ďalšie sady políčok budú prístupné po odomknutí nových herní.";
"AlertCloud"="Pozor";
"AlertCloudMessage"="Týmto sa resetne aj tvoj progres na iCloud-e.";

/* --- Gameplay --- */

"TableNumberAndDescription"="Stôl %d-%d\n%@";
"TableDescription"="%@\n(%@)";
"CurrentScoreEquation"="Aktuálne skóre = strely x ťahy\n%@";
"CurrentSolution"="Aktuálne riešenie\n%@";
"CreatorEquation"="Najlepšie skóre (autorom je %@) = strely x ťahy\n%@";
"BestRankAndScore"="Tvoje najlepšie hodnotenie / skóre = strely x ťahy\n%@ / %d = %d x %d";
"BestSolution"="Tvoje najlepšie riešenie\n%@";
"BestNoRankAndScore"="Tvoje najlepšie hodnotenie / skóre\n- / -";
"BestNoSolution"="Tvoje najlepšie riešenie\n-";

"Rank_1"="HRÁČ";
"Rank_2"="PROFÍK";
"Rank_3"="HVIEZDA";
"Rank_Final"="Tiliardista";

"TweetRank_1"="HRAC";
"TweetRank_2"="PROFIK";
"TweetRank_3"="HVIEZDA";
"Tweet"="Prave som v hre #Tiliard spratal stol %d-%d ako %@. Moje riesenie je '%@'. bit.ly/Tiliard";

"Subject"="Novy rekord stola";
"Body"="Caute 2 Key Players.\n\nPrave som prekonal rekord na stole %d-%d s riesenim '%@' a skore %@.\nV dalsej verzii ma uvedte pod menom '%@'.\n\nDik.";

"MaximumShotsReached"="Maximálny počet striel dosiahnutý!\nŤukni pre vrátenie poslednej strely späť.";
"DeadlockDetected"="Detekovaná nekonečná slučka!\nŤukni pre vrátenie poslednej strely späť.";

"Congratulations"="Gratulujeme!\nTvoje finálne skóre je %d / %d.";
"ThanksForPlaying"="Vďaka za dohranie Tiliard-u. Dúfame, že sa ti hra páčila.\nNové stoly očakávaj už čoskoro...";

"TellAFriend"="Pozri si túto unikátnu logickú hru pre iOS od @2keyplayers. Volá sa #Tiliard a je ozaj dobrá. Skús a uvidíš! http://bit.ly/Tiliard";

/* --- Tile Halls --- */

/* Tile Hall 1 */

"DescriptionTH01T01"="Základy";
"IntroTH01T01_1"="Vitaj v Tiliard-e! Toto je tzv. TIP.\nŤukni pre zobrazenie ďalšieho TIPU.";
"IntroTH01T01_2"="Cieľom hry je spratať všetky HRACIE POLÍČKA\nich potriafaním do DIER.";
"IntroTH01T01_3"="Ťukni hocikde na mriežku a položíš BIELE POLÍČKO.";
"IntroTH01T01_4"="BIELE POLÍČKO je automaticky umiestnené\nk najbližšiemu HRACIEMU POLÍČKU.";
"IntroTH01T01_5"="Ťukni na BIELE POLÍČKO a vystrelíš.";
"IntroTH01T01_6"="HRACIE POLÍČKO sa pohne o toľko miest,\naká číslica je na ňom zobrazená.";
"IntroTH01T01_7"="Poslednú strelu môžeš VRÁTIŤ späť\nstlačením tlačidla v ľavom hornom rohu. Skús to.";
"IntroTH01T01_8"="Hru je možné prerušiť TIME-OUT-om\nstlačením tlačidla v pravom hornom rohu.";
"IntroTH01T01_9"="Pre opätovné zobrazenie TIPOV choď do Hlavného menu\na zvoľ Možnosti -> Resetnúť -> Tipy.";
"IntroTH01T01_10"="Uži si to!";
"DescriptionTH01T02"="Diagonály";
"IntroTH01T02_1"="Na základe počtu STRIEL, ktoré spotrebuješ\nna spratanie stola získaš HODNOTENIE.";
"IntroTH01T02_2"="Čím nižší počet STRIEL,\ntým lepšie HODNOTENIE.";
"IntroTH01T02_3"="Priebeh HODNOTENIA je možné zobraziť\nstlačením tlačidla v ľavom dolnom rohu. Stlač ho.";
"IntroTH01T02_4"="Staň sa Tiliardovou Superhviezdou tak,\nže získaš HODNOTENIE Hviezda na všetkých stoloch.";
"IntroTH01T02_5"="Na získanie ocenenia 'Najlepšie skóre' musíš vyrovnať\ndoterajšie najlepšie skóre (strely x ťahy) stola.";
"IntroTH01T02_6"="Doterajšie najlepšie skóre zistíš pomocou\ntlačidla Detaily v TIME-OUT menu.";
"DescriptionTH01T03"="Rýchlo-strela";
"IntroTH01T03_1"="Ťukni dvakrát na mriežku\na vykonáš tzv. RÝCHLO-STRELU.";
"DescriptionTH01T04"="Asistent mierenia";
"IntroTH01T04_1"="Pre zobrazenie ASISTENTA MIERENIA pre HRACIE POLÍČKO\nnajprv polož BIELE POLÍČKO.";
"IntroTH01T04_2"="Ťukni na HRACIE POLÍČKO vedľa BIELEHO POLÍČKA\na uvidíš trajektóriu jeho pohybu.";
"IntroTH01T04_3"="Kolízie medzi HRACÍMI POLÍČKAMI\nnie sú ASISTENTOM MIERENIA zobrazované.";
"DescriptionTH01T05"="Mantinely";
"IntroTH01T05_1"="HRACIE POLÍČKO sa po náraze do MANTINELU od neho odrazí.";
"IntroTH01T05_2"="Využi MANTINELY na zlepšenie pozícií HRACÍCH POLÍČOK.";
"DescriptionTH01T06"="Multi-strela";
"IntroTH01T06_1"="Dobre umiestnená strela rozhýbe viac HRACÍCH POLÍČOK naraz.";
"DescriptionTH01T07"="Nahraj a strieľaj";
"DescriptionTH01T08"="Nižšia má prednosť";
"IntroTH01T08_1"="HRACIE POLÍČKO s nižším číslom sa vždy pohne ako prvé.";
"IntroTH01T08_2"="Keď sú HRACIE POLÍČKA v pohybe,\nťukni na mriežku, aby si ich zrýchlil.";
"DescriptionTH01T09"="Návnada";
"IntroTH01T09_1"="Na získanie ocenenia 'Rekord stola' musíš prekonať\ndoterajšie najlepšie skóre (strely x ťahy) stola.";
"IntroTH01T09_2"="Nezabudni svoje rekordné riešenie twítnuť\nalebo nám ho pošli e-mailom.";
"DescriptionTH01T10"="Skúška";

/* Tile Hall 2 */

"DescriptionTH02T01"="Deja Vu";
"IntroTH02T01_1"="Počnúc touto herňou je sila strely dôležitá.";
"IntroTH02T01_2"="HRACIE POLÍČKO musí zastaviť presne nad DIEROU,\naby do nej padlo.";
"DescriptionTH02T02"="Správny smer";
"DescriptionTH02T03"="Spomienky";
"DescriptionTH02T04"="Zvládnutie dier";
"IntroTH02T04_1"="Nauč a využi správanie sa DIER vo svoj prospech.";
"DescriptionTH02T05"="Stop-strela";
"IntroTH02T05_1"="HRACIE POLÍČKO, ktoré priamo narazí\ndo iného HRACIEHO POLÍČKA, sa zastaví.";
"DescriptionTH02T06"="Pravidlo 90-tich stupňov";
"IntroTH02T06_1"="Nepriama kolízia dvoch HRACÍCH POLÍČOK spôsobí ich odraz\npodľa pravidla 90-tich stupňov.";
"DescriptionTH02T07"="10 na východ";
"DescriptionTH02T08"="Dnu a von";
"DescriptionTH02T09"="Hore a dookola";
"DescriptionTH02T10"="T ako Tiliard";

/* Tile hall 3 */

"DescriptionTH03T01"="Šípky";
"IntroTH03T01_1"="Šípky menia smer pohybu HRACÍCH POLÍČOK.";
"DescriptionTH03T02"="Labyrint";
"DescriptionTH03T03"="Jediná";
"DescriptionTH03T04"="Trikšot";
"DescriptionTH03T05"="X-Tiles";
"IntroTH03T05_1"="X-ká zastavia pohyb HRACÍCH POLÍČOK.";
"DescriptionTH03T06"="Trojité X";
"DescriptionTH03T07"="Duchovia";
"IntroTH03T07_1"="Duchovia sa správajú ako nepohyblivé HRACIE POLÍČKA.";
"DescriptionTH03T08"="Strážcovia dier";
"DescriptionTH03T09"="Stena";
"DescriptionTH03T10"="Nasleduj znamenia";

/* Tile hall 4 */

"DescriptionTH04T01"="Čo, už zase?";
"IntroTH04T01_1"="Pre aplikovanie ROTÁCIE najprv polož BIELE POLÍČKO.";
"IntroTH04T01_2"="Ťukni a podrž na BIELOM POLÍČKU,\npotiahni hore alebo dole a pusť.";
"IntroTH04T01_3"="Ťukni na BIELE POLÍČKO a vystrelíš.";
"DescriptionTH04T02"="Dolná alebo horná";
"IntroTH04T02_1"="Dolná ROTÁCIA (ťahák) spôsobí,\nže HRACIE POLÍČKO prejde iba polovičnú vzdialenosť.";
"IntroTH04T02_2"="Horná ROTÁCIA (nábeh) spôsobí,\nže HRACIE POLÍČKO prejde raz takú vzdialenosť.";
"DescriptionTH04T03"="Rýchlo-strela s rotáciou";
"IntroTH04T03_1"="Ťukni dvakrát na mriežku, podrž, potiahni hore alebo dole,\nnásledne pusť a vykonáš tzv. RÝCHLO-STRELU s ROTÁCIOU.";
"DescriptionTH04T04"="Multi-strela s rotáciou";
"DescriptionTH04T05"="Srdce";
"DescriptionTH04T06"="Mínové pole";
"DescriptionTH04T07"="8V";
"DescriptionTH04T08"="Obe naraz";
"DescriptionTH04T09"="Políčko";
"DescriptionTH04T10"="Ukonči to!";

/* Tile hall 5 */

"DescriptionTH05T01"="Farby";
"IntroTH05T01_1"="V tejto herni hrajú dôležitú úlohu farby.";
"DescriptionTH05T02"="Jednosmerky";
"DescriptionTH05T03"="Semafór";
"DescriptionTH05T04"="Zlatá rybka";
"DescriptionTH05T05"="Domov, sladký domov";
"DescriptionTH05T06"="Sčítanie a odčítanie";
"IntroTH05T06_1"="Pluská/Mínusá menia dĺžku pohybu HRACIEHO POLÍČKA.";
"DescriptionTH05T07"="Inverzia";
"DescriptionTH05T08"="Autíčko";
"DescriptionTH05T09"="Pyramídy";
"DescriptionTH05T10"="Cieľová čiara";
